In [1]:
import pandas as pd
import numpy as np

In [2]:
suppliers = pd.read_csv("C:/Users/user/Desktop/Python_Main/kurs_pandas/northwind-mongo-master/suppliers.csv",
                       usecols=["SupplierID","CompanyName","Country"])

In [3]:
suppliers.head()

   SupplierID                         CompanyName Country
0           1                      Exotic Liquids      UK
1           2          New Orleans Cajun Delights     USA
2           3           Grandma Kelly's Homestead     USA
3           4                       Tokyo Traders   Japan
4           5  Cooperativa de Quesos 'Las Cabras'   Spain

In [4]:
customers = pd.read_csv("C:/Users/user/Desktop/Python_Main/kurs_pandas/northwind-mongo-master/customers.csv",
                       usecols=["CustomerID","CompanyName","Country"])

In [5]:
customers.head()

  CustomerID                         CompanyName  Country
0      ALFKI                 Alfreds Futterkiste  Germany
1      ANATR  Ana Trujillo Emparedados y helados   Mexico
2      ANTON            Antonio Moreno Taquer?­a   Mexico
3      AROUT                     Around the Horn       UK
4      BERGS                 Berglunds snabbk?¶p   Sweden

In [6]:
len(customers)

91

In [7]:
len(suppliers)

29

In [18]:
df = suppliers.append(customers,ignore_index=True)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   SupplierID   29 non-null     float64
 1   CompanyName  120 non-null    object
 2   Country      120 non-null    object
 3   CustomerID   91 non-null     object
dtypes: float64(1), object(3)
memory usage: 2.4+ KB

In [20]:
df.head(10)

   SupplierID                         CompanyName    Country CustomerID
0         1.0                      Exotic Liquids         UK        NaN
1         2.0          New Orleans Cajun Delights        USA        NaN
2         3.0           Grandma Kelly's Homestead        USA        NaN
3         4.0                       Tokyo Traders      Japan        NaN
4         5.0  Cooperativa de Quesos 'Las Cabras'      Spain        NaN
5         6.0                            Mayumi's      Japan        NaN
6         7.0                        Pavlova Ltd.  Australia        NaN
7         8.0             Specialty Biscuits Ltd.         UK        NaN
8         9.0                    PB Knäckebröd AB     Sweden        NaN
9        10.0           Refrescos Americanas LTDA     Brazil        NaN

In [17]:
df.iloc[9]

SupplierID                            10
CompanyName    Refrescos Americanas LTDA
Country                           Brazil
CustomerID                           NaN
Name: 9, dtype: object

In [22]:
supplier2 = suppliers.copy()

In [24]:
customers2 = customers.copy()

In [30]:
supplier2.rename({"SupplierID":"CustomerID"},axis="columns",inplace=True)

In [31]:
supplier2.head(10)

   CustomerID                         CompanyName    Country
0           1                      Exotic Liquids         UK
1           2          New Orleans Cajun Delights        USA
2           3           Grandma Kelly's Homestead        USA
3           4                       Tokyo Traders      Japan
4           5  Cooperativa de Quesos 'Las Cabras'      Spain
5           6                            Mayumi's      Japan
6           7                        Pavlova Ltd.  Australia
7           8             Specialty Biscuits Ltd.         UK
8           9                    PB Knäckebröd AB     Sweden
9          10           Refrescos Americanas LTDA     Brazil

In [32]:
supplier2.append(customers2)

   CustomerID                         CompanyName  Country
0           1                      Exotic Liquids       UK
1           2          New Orleans Cajun Delights      USA
2           3           Grandma Kelly's Homestead      USA
3           4                       Tokyo Traders    Japan
4           5  Cooperativa de Quesos 'Las Cabras'    Spain
..        ...                                 ...      ...
86      WARTH                      Wartian Herkku  Finland
87      WELLI              Wellington Importadora   Brazil
88      WHITC                White Clover Markets      USA
89      WILMK                         Wilman Kala  Finland
90      WOLZA                      Wolski  Zajazd   Poland

[120 rows x 3 columns]

In [33]:
df1 = pd.concat(objs = [suppliers,customers])

In [34]:
len(df1)

120

In [35]:
df1

    SupplierID                         CompanyName  Country CustomerID
0          1.0                      Exotic Liquids       UK        NaN
1          2.0          New Orleans Cajun Delights      USA        NaN
2          3.0           Grandma Kelly's Homestead      USA        NaN
3          4.0                       Tokyo Traders    Japan        NaN
4          5.0  Cooperativa de Quesos 'Las Cabras'    Spain        NaN
..         ...                                 ...      ...        ...
86         NaN                      Wartian Herkku  Finland      WARTH
87         NaN              Wellington Importadora   Brazil      WELLI
88         NaN                White Clover Markets      USA      WHITC
89         NaN                         Wilman Kala  Finland      WILMK
90         NaN                      Wolski  Zajazd   Poland      WOLZA

[120 rows x 4 columns]